RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_dma.h
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-11-10     SummerGift   first version
 * 2020-10-14     PeakRacing   Porting for stm32wbxx
 * 2026-04-13     wdfk-prog    Add STM32 DMA common helpers
 */

/**
 * @file drv_dma.h
 * @brief STM32 DMA common descriptors and helper interfaces.
 */

#ifndef __DRV_DMA_H_
#define __DRV_DMA_H_

#include <rtthread.h>
#include <board.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 * DMA-capable BSPs are expected to enable HAL_DMA_MODULE_ENABLED in the
 * STM32 HAL configuration, so keep the common DMA helper in the build.
 */
#ifdef HAL_DMA_MODULE_ENABLED

/**
 * @brief DMA capability classification for STM32 series supported by this BSP.
 */
#if defined(SOC_SERIES_STM32F0) || defined(SOC_SERIES_STM32F1) || defined(SOC_SERIES_STM32L0) || defined(SOC_SERIES_STM32L5) || defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32WL) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32G4) || defined(SOC_SERIES_STM32WB) || defined(SOC_SERIES_STM32F3) || defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS) || defined(SOC_SERIES_STM32L1)
#define DMA_INSTANCE_TYPE DMA_Channel_TypeDef
#elif defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32MP1)
#define DMA_INSTANCE_TYPE DMA_Stream_TypeDef
#endif /* defined(SOC_SERIES_STM32F0) || defined(SOC_SERIES_STM32F1) || defined(SOC_SERIES_STM32L0) || defined(SOC_SERIES_STM32L5)
|| defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32WL) || defined(SOC_SERIES_STM32G0)
|| defined(SOC_SERIES_STM32G4) || defined(SOC_SERIES_STM32WB) || defined(SOC_SERIES_STM32F3)
|| defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS) || defined(SOC_SERIES_STM32L1)*/

#if defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7)
#define STM32_DMA_USES_CHANNEL
#endif /* defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7) */

#if defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS)
#define STM32_DMA_USES_GPDMA
#endif /* defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS) */

#if defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32WL) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32G4) || defined(SOC_SERIES_STM32WB) || defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32MP1) || defined(SOC_SERIES_STM32L5) || defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS)
#define STM32_DMA_USES_REQUEST
#endif /* defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32WL) || defined(SOC_SERIES_STM32G0)
|| defined(SOC_SERIES_STM32G4) || defined(SOC_SERIES_STM32WB) || defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32MP1)
|| defined(SOC_SERIES_STM32L5) || defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS) */

#if defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32MP1)
#define STM32_DMA_SUPPORTS_FIFO
#endif /* defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32MP1) */

#if defined(SOC_SERIES_STM32F1) || defined(SOC_SERIES_STM32F0) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32L0) || defined(SOC_SERIES_STM32F3) || defined(SOC_SERIES_STM32L1)
#define STM32_DMA_USES_RCC_AHBENR
#endif /* defined(SOC_SERIES_STM32F1) || defined(SOC_SERIES_STM32F0) || defined(SOC_SERIES_STM32G0) || defined(SOC_SERIES_STM32L0) || defined(SOC_SERIES_STM32F3) || defined(SOC_SERIES_STM32L1) */

#if defined(SOC_SERIES_STM32MP1)
#define STM32_DMA_USES_RCC_MP_AHB2ENSETR
#endif /* defined(SOC_SERIES_STM32MP1) */

#if defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7) || defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32WL) || defined(SOC_SERIES_STM32G4) || defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32WB) || defined(SOC_SERIES_STM32L5) || defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS)
#define STM32_DMA_USES_RCC_AHB1ENR
#endif /* defined(SOC_SERIES_STM32F2) || defined(SOC_SERIES_STM32F4) || defined(SOC_SERIES_STM32F7)
|| defined(SOC_SERIES_STM32L4) || defined(SOC_SERIES_STM32WL) || defined(SOC_SERIES_STM32G4)
|| defined(SOC_SERIES_STM32H7) || defined(SOC_SERIES_STM32WB) || defined(SOC_SERIES_STM32L5)
|| defined(SOC_SERIES_STM32U5) || defined(SOC_SERIES_STM32H5) || defined(SOC_SERIES_STM32H7RS) */

#ifndef STM32_DMA_DEFAULT_PRIORITY
#define STM32_DMA_DEFAULT_PRIORITY DMA_PRIORITY_LOW
#endif /* STM32_DMA_DEFAULT_PRIORITY */

#ifndef STM32_DMA_DEFAULT_PREEMPT_PRIORITY
#define STM32_DMA_DEFAULT_PREEMPT_PRIORITY 0
#endif /* STM32_DMA_DEFAULT_PREEMPT_PRIORITY */

#ifndef STM32_DMA_DEFAULT_SUB_PRIORITY
#define STM32_DMA_DEFAULT_SUB_PRIORITY 0
#endif /* STM32_DMA_DEFAULT_SUB_PRIORITY */

#if defined(STM32_DMA_USES_GPDMA)
#ifndef STM32_GPDMA_DEFAULT_BLOCK_HW_REQUEST
#define STM32_GPDMA_DEFAULT_BLOCK_HW_REQUEST DMA_BREQ_SINGLE_BURST
#endif /* STM32_GPDMA_DEFAULT_BLOCK_HW_REQUEST */

#ifndef STM32_GPDMA_DEFAULT_SRC_BURST_LENGTH
#define STM32_GPDMA_DEFAULT_SRC_BURST_LENGTH 1U
#endif /* STM32_GPDMA_DEFAULT_SRC_BURST_LENGTH */

#ifndef STM32_GPDMA_DEFAULT_DEST_BURST_LENGTH
#define STM32_GPDMA_DEFAULT_DEST_BURST_LENGTH 1U
#endif /* STM32_GPDMA_DEFAULT_DEST_BURST_LENGTH */

#ifndef STM32_GPDMA_DEFAULT_TRANSFER_ALLOCATED_PORT
#define STM32_GPDMA_DEFAULT_TRANSFER_ALLOCATED_PORT 0U
#endif /* STM32_GPDMA_DEFAULT_TRANSFER_ALLOCATED_PORT */

#ifndef STM32_GPDMA_DEFAULT_TRANSFER_EVENT_MODE
#define STM32_GPDMA_DEFAULT_TRANSFER_EVENT_MODE DMA_TCEM_BLOCK_TRANSFER
#endif /* STM32_GPDMA_DEFAULT_TRANSFER_EVENT_MODE */
#endif /* defined(STM32_DMA_USES_GPDMA) */


/**
 * @brief DMA type classification for STM32 series supported by this BSP.
 */
typedef enum
{
    STM32_DMA_TYPE_DMA = 0,
    STM32_DMA_TYPE_BDMA,
} stm32_dma_type;


/**
 * @brief Common DMA configuration fields shared by DMA and BDMA.
 *
 * This base structure contains all common configuration fields. Both DMA and
 * BDMA descriptors embed it as their first member of struct stm32_dma_config,
 * enabling zero-cost pointer conversion for shared logic.
 */
struct stm32_dma_config_common
{
    void *Instance;                     /**< DMA/BDMA controller instance pointer (typed by child). */
    enum stm32_dma_type type;           /**< Type of the DMA controller. */
    rt_uint32_t dma_rcc;                /**< RCC enable bit for the DMA/BDMA controller. */
    IRQn_Type dma_irq;                  /**< DMA/BDMA global IRQ number. */
    rt_uint32_t priority;               /**< DMA/BDMA transfer priority. */
    rt_uint8_t preempt_priority;        /**< NVIC preempt priority for the DMA/BDMA IRQ. */
    rt_uint8_t sub_priority;            /**< NVIC sub priority for the DMA/BDMA IRQ. */

#if defined(STM32_DMA_USES_REQUEST) || defined(STM32_BDMA_USES_REQUEST)
    rt_uint32_t request;                /**< DMA/BDMA request selector. */
#endif
    rt_uint32_t direction;              /**< DMA/BDMA transfer direction. */
    rt_uint32_t periph_inc;             /**< Peripheral address increment mode. */
    rt_uint32_t mem_inc;                /**< Memory address increment mode. */
    rt_uint32_t periph_data_alignment;  /**< Peripheral data alignment. */
    rt_uint32_t mem_data_alignment;     /**< Memory data alignment. */
    rt_uint32_t mode;                   /**< DMA/BDMA transfer mode. */
};

/**
 * @brief Static DMA endpoint description used by board-level config headers.
 *
 * This descriptor stores one complete DMA endpoint configuration so peripheral
 * drivers can initialize DMA directly from the board-level config tables.
 */
struct stm32_dma_config
{
    struct stm32_dma_config_common common;  /**< Common DMA/BDMA configuration fields. */

#if defined(STM32_DMA_USES_GPDMA)
    rt_uint32_t blk_hw_request;         /**< GPDMA block hardware request mode. */
    rt_uint32_t src_inc;                /**< GPDMA source increment mode. */
    rt_uint32_t dest_inc;               /**< GPDMA destination increment mode. */
    rt_uint32_t src_data_width;         /**< GPDMA source data width. */
    rt_uint32_t dest_data_width;        /**< GPDMA destination data width. */
    rt_uint32_t src_burst_length;       /**< GPDMA source burst length. */
    rt_uint32_t dest_burst_length;      /**< GPDMA destination burst length. */
    rt_uint32_t transfer_allocated_port;/**< GPDMA allocated port selection. */
    rt_uint32_t transfer_event_mode;    /**< GPDMA transfer event mode. */
#else
#ifdef STM32_DMA_USES_CHANNEL
    rt_uint32_t channel;                /**< DMA channel selector for stream-based DMA. */
#endif /* STM32_DMA_USES_CHANNEL */

#if defined(STM32_DMA_SUPPORTS_FIFO)
    rt_uint32_t fifo_mode;              /**< FIFO enable state. */
    rt_uint32_t fifo_threshold;         /**< FIFO threshold selection. */
    rt_uint32_t mem_burst;              /**< Memory burst transfer mode. */
    rt_uint32_t periph_burst;           /**< Peripheral burst transfer mode. */
#endif /* defined(STM32_DMA_SUPPORTS_FIFO) */
#endif /* defined(STM32_DMA_USES_GPDMA) */
};

/**
 * @brief Optional selector fields kept in the descriptor for board-level readability.
 */
#if defined(STM32_DMA_USES_CHANNEL)
#define STM32_DMA_CHANNEL_FIELD(_channel) .channel = (_channel),
#else
#define STM32_DMA_CHANNEL_FIELD(_channel)
#endif /* defined(STM32_DMA_USES_CHANNEL) */

#if defined(STM32_DMA_USES_REQUEST)
#define STM32_DMA_REQUEST_FIELD(_request) .request = (_request),
#else
#define STM32_DMA_REQUEST_FIELD(_request)
#endif /* defined(STM32_DMA_USES_REQUEST) */

#if defined(STM32_DMA_SUPPORTS_FIFO)
#define STM32_DMA_FIFO_FIELD_DEFAULTS          \
    .fifo_mode = DMA_FIFOMODE_DISABLE,         \
    .fifo_threshold = DMA_FIFO_THRESHOLD_FULL, \
    .mem_burst = DMA_MBURST_SINGLE,            \
    .periph_burst = DMA_PBURST_SINGLE,

#define STM32_DMA_FIFO_FIELD_VALUES(_fifo_mode, _fifo_threshold, _mem_burst, _periph_burst) \
    .fifo_mode = (_fifo_mode),                                                              \
    .fifo_threshold = (_fifo_threshold),                                                    \
    .mem_burst = (_mem_burst),                                                              \
    .periph_burst = (_periph_burst),
#else
#define STM32_DMA_FIFO_FIELD_DEFAULTS
#define STM32_DMA_FIFO_FIELD_VALUES(_fifo_mode, _fifo_threshold, _mem_burst, _periph_burst)
#endif /* defined(STM32_DMA_SUPPORTS_FIFO) */

/**
 * @brief Generic descriptor initializer with explicit DMA direction and data layout.
 */
#define STM32_DMA_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority, _direction, _periph_inc, _mem_inc, _periph_data_alignment, _mem_data_alignment, _mode) \
    {                                                                                                                                                                                                                   \
        .common = {                                                                                                                                                                                                     \
            .Instance = (_instance),                                                                                                                                                                                    \
            .type = STM32_DMA_TYPE_DMA,                                                                                                                                                                                 \
            .dma_rcc = (_dma_rcc),                                                                                                                                                                                      \
            .dma_irq = (_dma_irq),                                                                                                                                                                                      \
            .priority = (_priority),                                                                                                                                                                                    \
            .preempt_priority = (_preempt_priority),                                                                                                                                                                    \
            .sub_priority = (_sub_priority),                                                                                                                                                                            \
            STM32_DMA_REQUEST_FIELD(_request)                                                                                                                                                                           \
                .direction = (_direction),                                                                                                                                                                              \
            .periph_inc = (_periph_inc),                                                                                                                                                                                \
            .mem_inc = (_mem_inc),                                                                                                                                                                                      \
            .periph_data_alignment = (_periph_data_alignment),                                                                                                                                                          \
            .mem_data_alignment = (_mem_data_alignment),                                                                                                                                                                \
            .mode = (_mode),                                                                                                                                                                                            \
        },                                                                                                                                                                                                              \
        STM32_DMA_CHANNEL_FIELD(_channel) STM32_DMA_FIFO_FIELD_DEFAULTS                                                                                                                                                 \
    }

/**
 * @brief Generic descriptor initializer for controllers that expose FIFO and burst fields.
 */
#define STM32_DMA_CONFIG_INIT_FIFO_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority, _direction, _periph_inc, _mem_inc, _periph_data_alignment, _mem_data_alignment, _mode, _fifo_mode, _fifo_threshold, _mem_burst, _periph_burst) \
    {                                                                                                                                                                                                                                                                                \
        .common = {                                                                                                                                                                                                                                                                  \
            .Instance = (_instance),                                                                                                                                                                                                                                                 \
            .type = STM32_DMA_TYPE_DMA,                                                                                                                                                                                                                                              \
            .dma_rcc = (_dma_rcc),                                                                                                                                                                                                                                                   \
            .dma_irq = (_dma_irq),                                                                                                                                                                                                                                                   \
            .priority = (_priority),                                                                                                                                                                                                                                                 \
            .preempt_priority = (_preempt_priority),                                                                                                                                                                                                                                 \
            .sub_priority = (_sub_priority),                                                                                                                                                                                                                                         \
            STM32_DMA_REQUEST_FIELD(_request)                                                                                                                                                                                                                                        \
                .direction = (_direction),                                                                                                                                                                                                                                           \
            .periph_inc = (_periph_inc),                                                                                                                                                                                                                                             \
            .mem_inc = (_mem_inc),                                                                                                                                                                                                                                                   \
            .periph_data_alignment = (_periph_data_alignment),                                                                                                                                                                                                                       \
            .mem_data_alignment = (_mem_data_alignment),                                                                                                                                                                                                                             \
            .mode = (_mode),                                                                                                                                                                                                                                                         \
        },                                                                                                                                                                                                                                                                           \
        STM32_DMA_CHANNEL_FIELD(_channel) STM32_DMA_FIFO_FIELD_VALUES(_fifo_mode, _fifo_threshold, _mem_burst, _periph_burst)                                                                                                                                                        \
    }

/**
 * @brief Common byte/word transfer descriptor helpers used by board-level config headers.
 */
#define STM32_DMA_RX_BYTE_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_DMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_channel), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_BYTE, DMA_MDATAALIGN_BYTE, DMA_NORMAL)

#define STM32_DMA_TX_BYTE_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_DMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_channel), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_MEMORY_TO_PERIPH, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_BYTE, DMA_MDATAALIGN_BYTE, DMA_NORMAL)

