RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_dma.h
#define STM32_DMA_RX_BYTE_CIRCULAR_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_DMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_channel), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_BYTE, DMA_MDATAALIGN_BYTE, DMA_CIRCULAR)

#define STM32_DMA_RX_WORD_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_DMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_channel), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_WORD, DMA_MDATAALIGN_WORD, DMA_NORMAL)

#define STM32_DMA_RX_WORD_CIRCULAR_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_DMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_channel), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_WORD, DMA_MDATAALIGN_WORD, DMA_CIRCULAR)

#define STM32_DMA_TX_WORD_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _channel, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_DMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_channel), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_MEMORY_TO_PERIPH, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_WORD, DMA_MDATAALIGN_WORD, DMA_NORMAL)

/**
 * @brief GPDMA descriptor initializer with explicit source and destination attributes.
 */
#define STM32_GPDMA_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority, _direction, _src_inc, _dest_inc, _src_data_width, _dest_data_width, _mode)                                                                                                                                                                                                                                                       \
    {                                                                                                                                                                                                                                                                                                                                                                                                                                                     \
        .common = {                                                                                                                                                                                                                                                                                                                                                                                                                                       \
            .Instance = (_instance),                                                                                                                                                                                                                                                                                                                                                                                                                      \
            .type = STM32_DMA_TYPE_DMA,                                                                                                                                                                                                                                                                                                                                                                                                                   \
            .dma_rcc = (_dma_rcc),                                                                                                                                                                                                                                                                                                                                                                                                                        \
            .dma_irq = (_dma_irq),                                                                                                                                                                                                                                                                                                                                                                                                                        \
            .priority = (_priority),                                                                                                                                                                                                                                                                                                                                                                                                                      \
            .preempt_priority = (_preempt_priority),                                                                                                                                                                                                                                                                                                                                                                                                      \
            .sub_priority = (_sub_priority),                                                                                                                                                                                                                                                                                                                                                                                                              \
            .request = (_request),                                                                                                                                                                                                                                                                                                                                                                                                                        \
            .direction = (_direction),                                                                                                                                                                                                                                                                                                                                                                                                                    \
            .mode = (_mode),                                                                                                                                                                                                                                                                                                                                                                                                                              \
        },                                                                                                                                                                                                                                                                                                                                                                                                                                                \
        .blk_hw_request = STM32_GPDMA_DEFAULT_BLOCK_HW_REQUEST, .src_inc = (_src_inc), .dest_inc = (_dest_inc), .src_data_width = (_src_data_width), .dest_data_width = (_dest_data_width), .src_burst_length = STM32_GPDMA_DEFAULT_SRC_BURST_LENGTH, .dest_burst_length = STM32_GPDMA_DEFAULT_DEST_BURST_LENGTH, .transfer_allocated_port = STM32_GPDMA_DEFAULT_TRANSFER_ALLOCATED_PORT, .transfer_event_mode = STM32_GPDMA_DEFAULT_TRANSFER_EVENT_MODE, \
    }

#define STM32_GPDMA_RX_BYTE_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_GPDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_SINC_FIXED, DMA_DINC_INCREMENTED, DMA_SRC_DATAWIDTH_BYTE, DMA_DEST_DATAWIDTH_BYTE, DMA_NORMAL)

