RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_dma.h
#define STM32_GPDMA_TX_BYTE_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_GPDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_MEMORY_TO_PERIPH, DMA_SINC_INCREMENTED, DMA_DINC_FIXED, DMA_SRC_DATAWIDTH_BYTE, DMA_DEST_DATAWIDTH_BYTE, DMA_NORMAL)

#define STM32_GPDMA_RX_BYTE_CIRCULAR_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_GPDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_SINC_FIXED, DMA_DINC_INCREMENTED, DMA_SRC_DATAWIDTH_BYTE, DMA_DEST_DATAWIDTH_BYTE, DMA_CIRCULAR)

#define STM32_GPDMA_RX_WORD_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_GPDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_SINC_FIXED, DMA_DINC_INCREMENTED, DMA_SRC_DATAWIDTH_WORD, DMA_DEST_DATAWIDTH_WORD, DMA_NORMAL)

#define STM32_GPDMA_RX_WORD_CIRCULAR_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_GPDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_SINC_FIXED, DMA_DINC_INCREMENTED, DMA_SRC_DATAWIDTH_WORD, DMA_DEST_DATAWIDTH_WORD, DMA_CIRCULAR)

#define STM32_GPDMA_TX_WORD_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_GPDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_MEMORY_TO_PERIPH, DMA_SINC_INCREMENTED, DMA_DINC_FIXED, DMA_SRC_DATAWIDTH_WORD, DMA_DEST_DATAWIDTH_WORD, DMA_NORMAL)

/**
 * @brief Apply one static DMA descriptor and initialize the HAL DMA handle.
 * @param dma_handle DMA handle to initialize.
 * @param dma_config Static DMA endpoint description.
 * @retval RT_EOK Success.
 * @retval -RT_ERROR HAL initialization failed.
 */
rt_err_t stm32_dma_init(DMA_HandleTypeDef *dma_handle,
                        const struct stm32_dma_config *dma_config);

/**
 * @brief Initialize one DMA handle, link it to the parent peripheral and enable its IRQ.
 * @param dma_handle DMA handle to initialize.
 * @param parent_handle Parent peripheral HAL handle.
 * @param dma_slot Parent peripheral DMA slot address, such as &huart->hdmarx.
 * @param dma_config Static DMA endpoint description.
 * @retval RT_EOK Success.
 * @retval -RT_ERROR HAL initialization failed.
 */
rt_err_t stm32_dma_setup(DMA_HandleTypeDef *dma_handle,
                         void *parent_handle,
                         DMA_HandleTypeDef **dma_slot,
                         const struct stm32_dma_config *dma_config);

/**
 * @brief Abort and de-initialize one DMA handle.
 *
 * The helper uses IRQ reference counting only for known shared DMA IRQ lines:
 * STM32F1 DMA2_Channel4_5_IRQn, STM32L0 DMA1_Channel4_5_6_7_IRQn and
 * STM32G0 DMA1_Channel2_3_IRQn. Other series keep direct IRQ disable behavior.
 *
 * @param dma_handle DMA handle to de-initialize.
 * @param dma_config Static DMA endpoint description.
 * @param abort_first RT_TRUE aborts the DMA transfer before de-initialization.
 * @retval RT_EOK Success.
 * @retval -RT_ERROR HAL abort or de-initialization failed.
 */
rt_err_t stm32_dma_deinit(DMA_HandleTypeDef *dma_handle,
                          const struct stm32_dma_config *dma_config,
                          rt_bool_t abort_first);

#endif /* HAL_DMA_MODULE_ENABLED */

#if defined(BSP_USING_BDMA) && (defined(SOC_SERIES_STM32H7))

/**
 * @brief BDMA configuration structure that inherits from the common base.
 *
 * BDMA on STM32H7 uses DMA_Channel_TypeDef instances and has no FIFO support.
 * All configuration fields are in the common base structure. The layout is a
 * prefix-compatible subset of struct stm32_dma_config, so a pointer to this
 * structure can be passed to the shared stm32_dma_init/setup/deinit API.
 */
struct stm32_bdma_config
{
    struct stm32_dma_config_common common;  /**< Common DMA/BDMA configuration fields. */
};

/**
 * @brief BDMA-specific macro guards for consistency with DMA.
 */
#ifndef STM32_BDMA_USES_REQUEST
#define STM32_BDMA_USES_REQUEST
#endif

#ifndef STM32_BDMA_DEFAULT_PRIORITY
#define STM32_BDMA_DEFAULT_PRIORITY DMA_PRIORITY_LOW
#endif

#ifndef STM32_BDMA_DEFAULT_PREEMPT_PRIORITY
#define STM32_BDMA_DEFAULT_PREEMPT_PRIORITY 0
#endif

#ifndef STM32_BDMA_DEFAULT_SUB_PRIORITY
#define STM32_BDMA_DEFAULT_SUB_PRIORITY 0
#endif

/**
 * @brief BDMA descriptor initializer with explicit direction and data layout.
 *
 * BDMA endpoints only use the common fields of struct stm32_dma_config; the
 * DMA-specific fields are left zero and skipped at runtime by the type check.
 */
#define STM32_BDMA_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority, _direction, _periph_inc, _mem_inc, _periph_data_alignment, _mem_data_alignment, _mode) \
    {                                                                                                                                                                                                          \
        .common = {                                                                                                                                                                                            \
            .Instance = (_instance),                                                                                                                                                                           \
            .type = STM32_DMA_TYPE_BDMA,                                                                                                                                                                       \
            .dma_rcc = (_dma_rcc),                                                                                                                                                                             \
            .dma_irq = (_dma_irq),                                                                                                                                                                             \
            .priority = (_priority),                                                                                                                                                                           \
            .preempt_priority = (_preempt_priority),                                                                                                                                                           \
            .sub_priority = (_sub_priority),                                                                                                                                                                   \
            .request = (_request),                                                                                                                                                                             \
            .direction = (_direction),                                                                                                                                                                         \
            .periph_inc = (_periph_inc),                                                                                                                                                                       \
            .mem_inc = (_mem_inc),                                                                                                                                                                             \
            .periph_data_alignment = (_periph_data_alignment),                                                                                                                                                 \
            .mem_data_alignment = (_mem_data_alignment),                                                                                                                                                       \
            .mode = (_mode),                                                                                                                                                                                   \
        }                                                                                                                                                                                                      \
    }

/**
 * @brief BDMA byte/word transfer descriptor helpers for board-level config.
 */
#define STM32_BDMA_RX_BYTE_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_BDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_PERIPH_TO_MEMORY, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_BYTE, DMA_MDATAALIGN_BYTE, DMA_NORMAL)

#define STM32_BDMA_TX_BYTE_CONFIG_INIT_EX(_instance, _dma_rcc, _dma_irq, _request, _priority, _preempt_priority, _sub_priority) \
    STM32_BDMA_CONFIG_INIT_EX((_instance), (_dma_rcc), (_dma_irq), (_request), (_priority), (_preempt_priority), (_sub_priority), DMA_MEMORY_TO_PERIPH, DMA_PINC_DISABLE, DMA_MINC_ENABLE, DMA_PDATAALIGN_BYTE, DMA_MDATAALIGN_BYTE, DMA_NORMAL)

#endif /* BSP_USING_BDMA && (SOC_SERIES_STM32H7) */

#ifdef __cplusplus
}
#endif

#endif /* __DRV_DMA_H_ */
